//------------------------------------------------------------------------------
// 화일명 : go_cmd.c
// 설  명 : ezBoot의 점프 관련 명령 처리 루틴이다. 
// 
// 작성자 : 유영창 (주)제이닷디엔티 frog@falinux.com
// 작성일 : 2001년 11월 16일
// 저작권 : (주)제이닷디엔티 
// 주  의 : 
//------------------------------------------------------------------------------

//******************************************************************************
//
// 헤더 정의
//
//******************************************************************************
#include <pxa255.h>
#include <stdio.h>
#include <string.h>

#include <config.h>
#include <mem_map.h>


/* 광역 변수 정의 -------------------------------------------------------------*/

extern TConfig Cfg;		// config.c 에 정의


//******************************************************************************
//
// 함수 정의
//
//******************************************************************************

//------------------------------------------------------------------------------
// 설명 : 아무런 옵션 없이 커널로 점프한다. 
// 매계 : argc    : 토큰 갯수 
//        argv    : 분리된 토큰 문자열 주소가 담겨질 배열 
// 반환 : 에러 -1  정상 0
//------------------------------------------------------------------------------
int 	GoKernelSingle( void )
{
    	char buff[] = { 0,0,0,0,0 }; // 명령 커맨드 시험용임 
    	void (*theKernel)(int zero, int arch);

	char kcmd[2048];
	int  len;
	
	// 커널 커맨드 문자열을 얻어온다.
	memset( kcmd, 0, 2048 );
	len = GetKCmdStr( kcmd );	

    	printf( "Starting kernel [MARCH %d]...\n", Cfg.Kernel_ArchNumber );

    	memcpy( (char *) DEFAULT_RAM_KERNEL_ZERO_PAGE, kcmd, 2048 );

    	theKernel = (void (*)(int, int))DEFAULT_RAM_KERNEL_START; 
    	theKernel( ( long ) 0 , (long) Cfg.Kernel_ArchNumber );

    	return 0;
}

//------------------------------------------------------------------------------
// 설명 : 커널로 점프한다. 
// 매계 : argc    : 토큰 갯수 
//        argv    : 분리된 토큰 문자열 주소가 담겨질 배열 
// 반환 : 에러 -1  정상 0
// 주의 : 없음 
//------------------------------------------------------------------------------
int 	GoKernel(int argc, char **argv)
{
	if ( Cfg.Watchdog )
	{
		SetWatchdog( Cfg.Watchdog*1000 );
	}

    	GoKernelSingle();
    	return 0;
}
//------------------------------------------------------------------------------
// 설명 : 함수로 점프한다. 
// 매계 : argc    : 토큰 갯수 
//        argv    : 분리된 토큰 문자열 주소가 담겨질 배열 
// 반환 : 에러 -1  정상 0
// 주의 : 없음 
//------------------------------------------------------------------------------
int 	GoFunction(int argc, char **argv)
{
	Word32  go_addr;
	void (*theFunction)(void);
	
	if ( argc < 1 )	return -1;
	
	go_addr = strtoul( argv[1], NULL, 0 );
	
	theFunction = ( void (*)(void) )go_addr;
	theFunction();
	
	return 0;
}


